app/controllers/admin/users_controller.rb

  def index
    @users = User.select(:id, :name, :email, :admin).order(created_at: :asc)
---
SELECT "users"."id", "users"."name", "users"."email", "users"."admin" FROM "users" ORDER BY "users"."created_at" ASC

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "admin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def show
    @tasks = Task.where(user_id: @user.id).page(params[:page]).per(5)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]

  def destroy
    user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]