app/controllers/tasks_controller.rb

  def index
    @q = current_user.tasks.includes(:user).ransack(params[:q])
    @tasks = @q.result(distinct: true).page(params[:page]).per(2)
---
SELECT COUNT(DISTINCT "tasks"."id") FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
SELECT DISTINCT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 2], ["OFFSET", 0]]

  def create
    @task = Task.new(task_params)
    @task.user_id = current_user.id
    @task = current_user.tasks.build(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "content", "created_at", "updated_at", "deadline", "status", "priority", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"