app/views/admin/users/show.html.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
---
        <th>Number of tasks</th>
        <td><%= @user.tasks.count %></td>